```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/cookiecutter-django-tfdo-demo-staging/runs/run-vCE38dhp1yyD4Vhz

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_spaces_bucket.bucket: Refreshing state... [id=cookiecutter-django-tfdo-demo-staging]
data.digitalocean_ssh_key.ssh_key: Reading...
module.droplet.digitalocean_domain.default[0]: Refreshing state... [id=cookiecutter-django-tfdo.xyz]
data.digitalocean_ssh_key.ssh_key: Read complete after 1s [name=martibosch-githubactions]
module.droplet.digitalocean_droplet.droplet: Refreshing state... [id=303709101]
module.droplet.digitalocean_record.default["staging.cookiecutter-django-tfdo.xyz."]: Refreshing state... [id=311918725]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.droplet.digitalocean_droplet.droplet is tainted, so must be replaced
-/+ resource "digitalocean_droplet" "droplet" {
      ~ created_at           = "2022-06-11T11:59:28Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "303709101" -> (known after apply)
      ~ ipv4_address         = "164.92.250.158" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "cookiecutter-django-tfdo-demo-staging"
      ~ price_hourly         = 0.02976 -> (known after apply)
      ~ price_monthly        = 20 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:303709101" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "1c258bb0-6336-4320-95de-1fb9e3184054" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.droplet.digitalocean_record.default["staging.cookiecutter-django-tfdo.xyz."] will be updated in-place
  ~ resource "digitalocean_record" "default" {
        id       = "311918725"
        name     = "staging"
      ~ value    = "159.89.3.122" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ id           = "299772566" -> (known after apply)
  ~ ipv4_address = "159.89.3.122" -> (known after apply)

```